import React from "react";

function HouseExplain(){
  return(
    <div className={'containerExplain my-4'}>
      {/*<hr className={'PositionHr'}/>*/}
      {/*<div className={'PositionHr'}></div>*/}
      <div className={'EXPLine mb-4'}>숙소설명</div>
      <div className={'pt-2 pb-4'}>
        <p>
          ** 주말, 연휴기간, 6~9월 예약은 2박이상을 우선적으로 받고 있으며 1박예약은 어려운점 양해바랍니다.

          기준인원 4인 / 최대인원 6인

          침실3+욕실2+주방+거실
          Outside - 단독야외수영장, 야외노천탕, 데크, 바베큐그릴, 잔디정원

          * 실내노천탕 : 2인용 욕조사이즈. 사계절 사용가능 (온수무료)
          * 야외수영장 오픈 : 5/27~10/3 (냉수풀입니다. 온수풀X)
          4.5 * 3m, 90cm (단독사용)

          농사도 짓고, 배도 타는 제주토박이 '다다네'가
          설계부터 시공까지 직영으로 지은 '느링느링스테이'
          신풍리 마을에 평생을 지낼 집으로 정성껏 만들고 가꾸는 소중한 집과 귤밭 입니다.
          조용하고 한적한 이곳에서.. 제주스러움 가득한 돌담과 귤밭 사이를 산책도 하고, 넓은 잔디마당에서 마음껏 뛰어놀며
          느리고.. 천천히 머물며 여유를 채워가시길 바랍니다.

          위치. 서귀포시 성산읍 신풍리 998-1
          숙소
          기준인원 4인 / 최대인원 6인
          **코로나 방역지침에 맞춰 투숙가능합니다.(영.유아 포함)

          침실3+욕실2+주방+거실+야외노천탕
          Outside - 단독야외수영장, 데크, 바베큐그릴, 잔디정원


          제주동쪽 감귤밭 독채풀빌라 "느링느링 스테이"는
          600평 규모의 감귤밭을 마주하고 개별 수영장과 쓰리룸 독채구조의 풀스테이 3동이 모여 있습니다.
          느링느링 스테이의 3동중 "다로제하우스"는
          높은 천정의 시원한 개방감의 거실과 오픈침실.
          거실이 내려다보이는 다락방과 야외노천탕, 개별수영장을 갖춘 쓰리룸 구조의 신축풀빌라 입니다.
          거실앞 넓은 데크와 단독수영장쪽으로 바베큐그릴과 테이블이 준비되어 있고
          수영장 앞으로 펼쳐진 잔디정원과 귤밭은 이루말할 수 없는 평화로움을 선사합니다.

          느링느링스테이에서 여유로운 제주에서의 쉼을 느껴보세요.
          게스트 이용 가능 공간/시설
          1F - 오픈침실+침대룸+욕실2개+거실+주방
          2F - 오픈다락방+야외테라스+실내노천탕
          Outside - 단독수영장, 데크, 바베큐시설, 잔디정원, 감귤밭

          * 실내노천탕 : 2인용 욕조사이즈. 사계절이용가능 (온수무료)
          * 야외수영장 (냉수로만 운영, 온수풀X)
          오픈기간 : 5/27~10/3, 4.5 * 3m, 높이 90cm
        </p>
      </div>

    </div>
  )
}

export default HouseExplain